; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	thermograph0 - mode
	image2 - mode
	image1 - mode
	Star3 - direction
	Star5 - direction
	Star8 - direction
	Star9 - direction
	GroundStation10 - direction
	GroundStation11 - direction
	GroundStation7 - direction
	GroundStation12 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star0 - direction
	GroundStation6 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Star17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation11)
	(calibration_target instrument0 GroundStation10)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation12)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument3 thermograph0)
	(supports instrument3 image2)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(pointing satellite0 Star14)
	(have_image Phenomenon13 image2)
	(have_image Star14 image2)
	(have_image Phenomenon15 thermograph0)
	(have_image Star16 image2)
	(have_image Star17 image2)
	(have_image Star18 image1)
))

)

; plan
1. (turn_to satellite1 groundstation4 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 7
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 0 of 7
4. (turn_to satellite1 phenomenon15 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon15)
   goals met: 0 of 7
5. (take_image satellite1 phenomenon15 instrument3 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon13 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 7
7. (turn_to satellite0 star14 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star14)
   goals met: 2 of 7
8. (take_image satellite1 phenomenon13 instrument3 image2)
   added: (have_image phenomenon13 image2)
   goals met: 3 of 7
9. (turn_to satellite1 star14 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star14)
   goals met: 3 of 7
10. (take_image satellite1 star14 instrument3 image2)
   added: (have_image star14 image2)
   goals met: 4 of 7
11. (turn_to satellite1 star16 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star16)
   goals met: 4 of 7
12. (take_image satellite1 star16 instrument3 image2)
   added: (have_image star16 image2)
   goals met: 5 of 7
13. (turn_to satellite1 star17 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star17)
   goals met: 5 of 7
14. (take_image satellite1 star17 instrument3 image2)
   added: (have_image star17 image2)
   goals met: 6 of 7
15. (turn_to satellite1 star18 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 star18)
   goals met: 6 of 7
16. (take_image satellite1 star18 instrument3 image1)
   added: (have_image star18 image1)
   goals met: 7 of 7
